
# 6.1)	Создайте словарь, содержащий перечень стран и их столиц.
# a)	Выведите на экран все пары ключ-значение.
# b)	Выведите на экран столицу для определенной страны.
# c)	Отсортируйте и выведите на экран содержимое словаря в алфавитном порядке названий стран.
def task_1():
    countries = {'Россия': 'Москва', 'Испания': 'Мадрид', 'Австралия': 'Канберра', 'Лапландия': 'Рованиеми'}
    for key, value in countries.items():
        print(f"{key}: {value}")


task_1()


# 6.2)	В игре в слова «Эрудит» каждая буква имеет определенную ценность:
# А, В, Е, И, Н, О, Р, С, Т – 1 очко; Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка;
# Й, Ы – 4 очка;
# Ж, З, Х, Ц, Ч – 5 очков;
# Ш, Э, Ю – 8 очков; Ф, Щ, Ъ – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова.
def task_2():
    pass


# 6.3)	*Доп.задание на множество.
# Есть множество студентов. Каждый из них знает некоторое количество языков.
# Нужно определить сколько различных языков знают студенты.
# Выведите отсортированный список этих языков. Выведите список студентов, которые знают китайский язык.
def task_3():
    pass
